## Plan Result (test-frontdoor)




<pre><code>Plan: 0 to add, 10 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.fd_rg
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;portal-test&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.fd_rg will be updated in-place
  ~ resource "azurerm_resource_group" "fd_rg" {
        id       = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg"
        name     = "lz-test-rg"
      ~ tags     = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test"
        name                                 = "sdshmcts-test"
      ~ tags                                 = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (49 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendtest"
        name                              = "pipfrontendtest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["portal-test"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portaltesttest"
        name                              = "portaltesttest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmttest"
        name                              = "sdsapimgmttest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeetest"
        name                              = "toffeetest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebtest"
        name                              = "vhadminwebtest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhtestwebtest"
        name                              = "vhtestwebtest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebtest"
        name                              = "vhvideowebtest"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/lz-test-rg/providers/Microsoft.Network/frontDoors/sdshmcts-test|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 10 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":346,"Program":"tfcmt","SHA1":"","Target":"test-frontdoor","Vars":{}} -->